//: # _Паттерны_
//: ### Паттерн проектирования — это часто встречающееся решение определённой проблемы при проектировании архитектуры программ.
//:
//: ### В отличие от готовых функций или библиотек, паттерн нельзя просто взять и скопировать в программу. Паттерн представляет собой не какой-то конкретный код, а общую концепцию решения той или иной проблемы, которую нужно будет ещё подстроить под нужды вашей программы.
//:
//: ### Паттерны часто путают с алгоритмами, ведь оба понятия описывают типовые решения каких-то известных проблем. Но если алгоритм — это чёткий набор действий, то паттерн — это высокоуровневое описание решения, реализация которого может отличаться в двух разных программах.
//:
//: ### Если привести аналогии, то алгоритм — это кулинарный рецепт с чёткими шагами, а паттерн — инженерный чертёж, на котором нарисовано решение, но не конкретные шаги его реализации.
//:
//: ## Паттерны делятся на:
//: * [порождающие](@next)
//: * [структурные](StructuralPatterns)
//: * [поведенческие](BehavioralPatterns)
